qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_cdc.c
    /*
    switch (port) {
    #define UDI_CDC_PORT_TO_IFACE_COMM(index, unused) \
        case index: \
            iface_comm_num = UDI_CDC_COMM_IFACE_NUMBER_##index; \
            break;
        MREPEAT(UDI_CDC_PORT_NB, UDI_CDC_PORT_TO_IFACE_COMM, ~)
    #undef UDI_CDC_PORT_TO_IFACE_COMM
        default:
            iface_comm_num = UDI_CDC_COMM_IFACE_NUMBER_0;
            break;
        }
    */
    iface_comm_num = UDI_CDC_COMM_IFACE_NUMBER_0;

    uid_cdc_state_msg[port].header.wIndex = LE16(iface_comm_num);
    uid_cdc_state_msg[port].header.wLength = LE16(2);
    uid_cdc_state_msg[port].value = CPU_TO_LE16(0);

    udi_cdc_line_coding[port].dwDTERate = CPU_TO_LE32(UDI_CDC_DEFAULT_RATE);
    udi_cdc_line_coding[port].bCharFormat = UDI_CDC_DEFAULT_STOPBITS;
    udi_cdc_line_coding[port].bParityType = UDI_CDC_DEFAULT_PARITY;
    udi_cdc_line_coding[port].bDataBits = UDI_CDC_DEFAULT_DATABITS;
    // Call application callback
    // to initialize memories or indicate that interface is enabled
#if 0
    UDI_CDC_SET_CODING_EXT(port,(&udi_cdc_line_coding[port]));
    if (!UDI_CDC_ENABLE_EXT(port)) {
        return false;
    }
#endif
    udi_cdc_nb_comm_enabled++;
    return true;
}

bool udi_cdc_data_enable(void)
{
    uint8_t port;

//#if UDI_CDC_PORT_NB == 1 // To optimize code
    port = 0;
    udi_cdc_nb_data_enabled = 0;
//#else
//    if (udi_cdc_nb_data_enabled > UDI_CDC_PORT_NB) {
//        udi_cdc_nb_data_enabled = 0;
//    }
//    port = udi_cdc_nb_data_enabled;
//#endif

    // Initialize TX management
    udi_cdc_tx_trans_ongoing[port] = false;
    udi_cdc_tx_both_buf_to_send[port] = false;
    udi_cdc_tx_buf_sel[port] = 0;
    udi_cdc_tx_buf_nb[port][0] = 0;
    udi_cdc_tx_buf_nb[port][1] = 0;
    udi_cdc_tx_sof_num[port] = 0;
    udi_cdc_tx_send(port);

    // Initialize RX management
    udi_cdc_rx_trans_ongoing[port] = false;
    udi_cdc_rx_buf_sel[port] = 0;
    udi_cdc_rx_buf_nb[port][0] = 0;
    udi_cdc_rx_buf_nb[port][1] = 0;
    udi_cdc_rx_pos[port] = 0;
    if (!udi_cdc_rx_start(port)) {
        return false;
    }
    udi_cdc_nb_data_enabled++;
    if (udi_cdc_nb_data_enabled == UDI_CDC_PORT_NB) {
        udi_cdc_data_running = true;
    }
    return true;
}

void udi_cdc_comm_disable(void)
{
    Assert(udi_cdc_nb_comm_enabled != 0);
    udi_cdc_nb_comm_enabled--;
}

void udi_cdc_data_disable(void)
{
//  uint8_t port;

    Assert(udi_cdc_nb_data_enabled != 0);
    udi_cdc_nb_data_enabled--;
//  port = udi_cdc_nb_data_enabled;
//  UDI_CDC_DISABLE_EXT(port);
    udi_cdc_data_running = false;
}

bool udi_cdc_comm_setup(void)
{
    uint8_t port = udi_cdc_setup_to_port();

    if (Udd_setup_is_in()) {
        // GET Interface Requests
        if (Udd_setup_type() == USB_REQ_TYPE_CLASS) {
            // Requests Class Interface Get
            switch (udd_g_ctrlreq.req.bRequest) {
            case USB_REQ_CDC_GET_LINE_CODING:
                // Get configuration of CDC line
                if (sizeof(usb_cdc_line_coding_t) !=
                        udd_g_ctrlreq.req.wLength)
                    return false; // Error for USB host
                udd_g_ctrlreq.payload =
                        (uint8_t *) &
                        udi_cdc_line_coding[port];
                udd_g_ctrlreq.payload_size =
                        sizeof(usb_cdc_line_coding_t);
                return true;
            }
        }
    }
    if (Udd_setup_is_out()) {
        // SET Interface Requests
        if (Udd_setup_type() == USB_REQ_TYPE_CLASS) {
            // Requests Class Interface Set
            switch (udd_g_ctrlreq.req.bRequest) {
            case USB_REQ_CDC_SET_LINE_CODING:
                // Change configuration of CDC line
                if (sizeof(usb_cdc_line_coding_t) !=
                        udd_g_ctrlreq.req.wLength)
                    return false; // Error for USB host
                udd_g_ctrlreq.callback =
                        udi_cdc_line_coding_received;
                udd_g_ctrlreq.payload =
                        (uint8_t *) &
                        udi_cdc_line_coding[port];
                udd_g_ctrlreq.payload_size =
                        sizeof(usb_cdc_line_coding_t);
                return true;
            case USB_REQ_CDC_SET_CONTROL_LINE_STATE:
                // According cdc spec 1.1 chapter 6.2.14
//              UDI_CDC_SET_DTR_EXT(port, (0 !=
//                      (udd_g_ctrlreq.req.wValue
//                       & CDC_CTRL_SIGNAL_DTE_PRESENT)));
//              UDI_CDC_SET_RTS_EXT(port, (0 !=
//                      (udd_g_ctrlreq.req.wValue
//                       & CDC_CTRL_SIGNAL_ACTIVATE_CARRIER)));
                return true;
            }
        }
    }
    return false;  // request Not supported
}

bool udi_cdc_data_setup(void)
{
    return false;  // request Not supported
}

uint8_t udi_cdc_getsetting(void)
{
    return 0;      // CDC don't have multiple alternate setting
}

void udi_cdc_data_sof_notify(void)
{
    static uint8_t port_notify = 0;

    // A call of udi_cdc_data_sof_notify() is done for each port
    udi_cdc_tx_send(port_notify);
    /*
#if UDI_CDC_PORT_NB != 1 // To optimize code
    port_notify++;
    if (port_notify >= UDI_CDC_PORT_NB) {
        port_notify = 0;
    }
#endif
    */
}


//-------------------------------------------------
//------- Internal routines to control serial line

static uint8_t udi_cdc_setup_to_port(void)
{
    uint8_t port;

    /*
    switch (udd_g_ctrlreq.req.wIndex & 0xFF) {
#define UDI_CDC_IFACE_COMM_TO_PORT(iface, unused) \
    case UDI_CDC_COMM_IFACE_NUMBER_##iface: \
        port = iface; \
        break;
    MREPEAT(UDI_CDC_PORT_NB, UDI_CDC_IFACE_COMM_TO_PORT, ~)
#undef UDI_CDC_IFACE_COMM_TO_PORT
    default:
        port = 0;
        break;
    }
    */
    port = 0;

    return port;
}

static void udi_cdc_line_coding_received(void)
{
    uint8_t port = udi_cdc_setup_to_port();
    UNUSED(port);

//  UDI_CDC_SET_CODING_EXT(port, (&udi_cdc_line_coding[port]));
}

static void udi_cdc_ctrl_state_change(uint8_t port, bool b_set, le16_t bit_mask)
{
    udd_ep_id_t ep_comm;
    uint32_t irqflags;  //irqflags_t


//#if UDI_CDC_PORT_NB == 1 // To optimize code
    port = 0;
//#endif

    // Update state
  irqflags = __get_PRIMASK();
  __disable_irq();
  __DMB();
    if (b_set) {
        udi_cdc_state[port] |= bit_mask;
    } else {
        udi_cdc_state[port] &= ~(unsigned)bit_mask;
    }
    __DMB();
  __set_PRIMASK(irqflags);

